Repository: teslor/sms-telebot
Catalog: lib/l10n/app_*.arb
Languages: de, es, hi, ja, pt, ru, zh

# sms_empty
source: No incoming SMS in current session
de: Keine eingehenden SMS in aktueller Sitzung
es: No hay SMS entrantes en la sesión actual
hi: वर्तमान सत्र में कोई SMS नहीं
ja: 現在のセッションに 受信SMSはありません
pt: Nenhum SMS recebido na sessão atual
ru: Нет входящих СМС в текущей сессии
zh: 当前会话中 无接收短信

# sms_hello
source: Hello from SMS Telebot! =^•⩊•^=
de: Hallo von SMS Telebot! =^•⩊•^=
es: ¡Hola desde SMS Telebot! =^•⩊•^=
hi: SMS Telebot से नमस्ते! =^•⩊•^=
ja: SMS Telebotからこんにちは！=^•⩊•^=
pt: Olá do SMS Telebot! =^•⩊•^=
ru: Привет от SMS Telebot! =^•⩊•^=
zh: 来自 SMS Telebot 的问候！=^•⩊•^=

source: SMS from
de: SMS von
es: SMS de
hi: SMS प्रेषक
ja: 送信元
pt: SMS de
ru: СМС от
zh: 短信来自

# sms_received
source: Received
de: Empfangen
es: Recibido
hi: प्राप्त
ja: 受信
pt: Recebido
ru: Получено
zh: 已接收

# sms_sent
source: Sent to bot
de: An Bot gesendet
es: Enviado al bot
hi: फ़ॉरवर्ड किया गया
ja: 転送済み
pt: Enviado ao bot
ru: Переслано
zh: 已转发

# sms_receivedRecently
source: Received recently
de: Kürzlich empfangen
es: Recibido recientemente
pt: Recebido recentemente

source: FILTERS
de: FILTER
es: FILTROS
hi: फ़िल्टर
ja: フィルター
pt: FILTROS
ru: ФИЛЬТРЫ
zh: 筛选器

# filters_off
source: Off
de: Aus
es: Desactivado
hi: बंद
ja: オフ
pt: Desativado
ru: Без фильтров
zh: 关闭

# filters_whitelist
source: Whitelist
es: Lista blanca
hi: व्हाइटलिस्ट
ja: ホワイトリスト
pt: Lista branca
ru: Белый список
zh: 白名单

# filters_blacklist
source: Blacklist
es: Lista negra
hi: ब्लैकलिस्ट
ja: ブラックリスト
pt: Lista negra
ru: Чёрный список
zh: 黑名单

# filters_sender
source: Sender
de: Absender
es: Remitente
hi: प्रेषक
ja: 送信元
pt: Remetente
ru: Отправитель
zh: 发件人

# filters_senderInfo
source: Add filters for numbers or names
de: Filter für Nummern oder Namen hinzufügen
es: Añade filtros para números o nombres
hi: नंबर या नाम के लिए फ़िल्टर जोड़ें
ja: 番号または名前のフィルターを追加
pt: Adicione filtros para números ou nomes
ru: Добавьте фильтры для номеров/имён
zh: 添加号码或名称筛选器

# filters_text
source: Message
de: Nachricht
es: Mensaje
hi: संदेश
ja: メッセージ
pt: Mensagem
ru: Сообщение
zh: 消息

# filters_textInfo
source: Add filters for SMS text
de: Filter für SMS-Text hinzufügen
es: Añade filtros para el texto del SMS
hi: SMS टेक्स्ट के लिए फ़िल्टर जोड़ें
ja: SMSテキストのフィルターを追加
pt: Adicione filtros para o texto do SMS
ru: Добавьте фильтры для текста СМС
zh: 添加短信文本筛选器

# filters_test
source: Test
de: Testen
es: Probar
hi: टेस्ट करें
ja: テスト
pt: Testar
ru: Проверить
zh: 测试

# filters_save
source: Save
de: Speichern
es: Guardar
hi: सहेजें
ja: 保存
pt: Salvar
ru: Сохранить
zh: 保存

source: SETTINGS
de: EINSTELLUNGEN
es: CONFIGURACIÓN
hi: सेटिंग्स
ja: 設定
pt: CONFIGURAÇÕES
ru: НАСТРОЙКИ
zh: 设置

# settings_token
source: Bot token
es: Token del bot
hi: बॉट टोकन
ja: ボットトークン
pt: Token do bot
ru: Токен
zh: 机器人令牌

# settings_tokenInfo
source: Bot token you've got from @BotFather
de: Token vom @BotFather erhalten
es: Token obtenido de @BotFather
hi: @BotFather से प्राप्त टोकन
ja: @BotFatherから取得したトークン
pt: Token obtido do @BotFather
ru: Токен бота, полученный от @BotFather
zh: 从 @BotFather 获取的令牌

# settings_chatId
source: Chat ID
es: ID del chat
hi: चैट ID
ja: チャットID
pt: ID do chat
ru: ID чата
zh: 聊天 ID

# settings_chatIdInfo
source: ID of a chat with your bot (optional)
de: ID des Chats mit Ihrem Bot (optional)
es: ID del chat con tu bot (opcional)
hi: आपके बॉट के साथ चैट की ID (वैकल्पिक)
ja: ボットとのチャットのID（オプション）
pt: ID do chat com seu bot (opcional)
ru: ID чата с ботом (опционально)
zh: 与您的机器人的聊天 ID（可选）

# settings_deviceLabel
source: Device label
de: Gerätename
es: Etiqueta del dispositivo
hi: डिवाइस लेबल
ja: デバイスラベル
pt: Rótulo do dispositivo
ru: Метка устройства
zh: 设备标签

# settings_deviceLabelInfo
source: Custom label (optional)
de: Benutzerdefinierte Bezeichnung (optional)
es: Etiqueta personalizada (opcional)
hi: कस्टम लेबल (वैकल्पिक)
ja: カスタムラベル（オプション）
pt: Rótulo personalizado (opcional)
ru: Пользовательская метка (опционально)
zh: 自定义标签（可选

# settings_test
source: Test & Save
de: Testen & Speichern
es: Probar y guardar
hi: टेस्ट और सहेजें
ja: テストして保存
pt: Testar e salvar
ru: Проверить и сохранить
zh: 测试并保存

# help_about
source: About
de: Über
es: Acerca de
hi: ऐप के बारे में
ja: このアプリについて
pt: Sobre
ru: О приложении
zh: 关于

# help_appInfo
source: App to automatically forward incoming SMS messages to a Telegram bot
de: App zum automatischen Weiterleiten eingehender SMS an einen Telegram-Bot
es: App para reenviar automáticamente mensajes SMS entrantes a un bot de Telegram
hi: आने वाले SMS संदेशों को स्वचालित रूप से Telegram बॉट को भेजने के लिए ऐप
ja: 受信したSMSメッセージを自動的にTelegramボットに転送するアプリ
pt: App para encaminhar automaticamente mensagens SMS recebidas para um bot do Telegram
ru: Приложение для автоматической пересылки входящих СМС-сообщений Telegram-боту
zh: 自动将接收的短信转发至 Telegram 机器人的应用

# help_howToUse
source: How to use
de: Anleitung
es: Cómo usar
hi: उपयोग कैसे करें
ja: 使い方
pt: Como usar
ru: Как использовать
zh: 使用方法

# help_howToUse_01
source: If you don't have a Telegram bot yet, use @BotFather bot to create one and get its token. It's simple and free.
de: Falls Sie noch keinen Telegram-Bot haben, erstellen Sie einen mit @BotFather und erhalten Sie dessen Token. Es ist einfach und kostenlos.
es: Si aún no tienes un bot de Telegram, usa @BotFather para crear uno y obtener su token. Es simple y gratuito.
hi: यदि आपके पास अभी तक Telegram बॉट नहीं है, तो @BotFather का उपयोग करके एक बनाएं और इसका टोकन प्राप्त करें। यह आसान और मुफ़्त है।
ja: Telegramボットをまだお持ちでない場合は、@BotFatherを使用して作成し、トークンを取得してください。簡単で無料です。
pt: Se você ainda não tem um bot do Telegram, use o @BotFather para criar um e obter seu token. É simples e gratuito.
ru: Если у вас пока нет Telegram-бота, создайте его с помощью бота @BotFather и получите токен. Это просто и бесплатно.
zh: 如果您还没有 Telegram 机器人，请使用 @BotFather 创建一个并获取其令牌。这很简单且免费。

# help_howToUse_02
source: Open a chat with your bot in Telegram, start a conversation, or send any message. This is needed to automatically retrieve the chat id for the next step.
de: Öffnen Sie einen Chat mit Ihrem Bot in Telegram, starten Sie ein Gespräch oder senden Sie eine Nachricht. Dies ist erforderlich, um die Chat-ID automatisch abzurufen.
es: Abre un chat con tu bot en Telegram, inicia una conversación o envía cualquier mensaje. Esto es necesario para obtener automáticamente el ID del chat.
hi: Telegram में अपने बॉट के साथ चैट खोलें, बातचीत शुरू करें या कोई संदेश भेजें। यह अगले चरण के लिए चैट ID स्वचालित रूप से प्राप्त करने के लिए आवश्यक है।
ja: Telegramでボットとのチャットを開き、会話を開始するか、メッセージを送信してください。これは次のステップでチャットIDを自動的に取得するために必要です。
pt: Abra um chat com seu bot no Telegram, inicie uma conversa ou envie qualquer mensagem. Isso é necessário para obter automaticamente o ID do chat na próxima etapa.
ru: Откройте чат с вашим ботом в Telegram, нажмите /start или отправьте любое сообщение. Это нужно для автоматического получения ID чата на следующем шаге.
zh: 在 Telegram 中打开与您的机器人的聊天，开始对话或发送任何消息。这是自动获取聊天 ID 所必需的。

# help_howToUse_03
source: Go to the app, in bot settings, enter the token, and test settings (you can also set the chat id if you know it). If the test is successful, the settings are saved, and a hello message is sent to the Telegram chat.
de: Öffnen Sie die App, geben Sie in den Bot-Einstellungen das Token ein und testen Sie die Einstellungen (Sie können auch die Chat-ID angeben, falls bekannt). Bei erfolgreichem Test werden die Einstellungen gespeichert und eine Begrüßungsnachricht an den Telegram-Chat gesendet.
es: Abre la app, en configuración del bot, introduce el token y prueba los ajustes (también puedes establecer el ID del chat si lo conoces). Si la prueba es exitosa, la configuración se guarda y se envía un mensaje de bienvenida al chat de Telegram.
hi: ऐप खोलें, बॉट सेटिंग्स में टोकन दर्ज करें और सेटिंग्स का परीक्षण करें (यदि आप जानते हैं तो चैट ID भी सेट कर सकते हैं)। यदि परीक्षण सफल होता है, तो सेटिंग्स सहेज ली जाती हैं और Telegram चैट में एक स्वागत संदेश भेजा जाता है।
ja: アプリを開き、ボット設定でトークンを入力して設定をテストします（チャットIDがわかっている場合は設定することもできます）。テストが成功すると、設定が保存され、Telegramチャットにウェルカムメッセージが送信されます。
pt: Abra o app, nas configurações do bot, insira o token e teste as configurações (você também pode definir o ID do chat se souber). Se o teste for bem-sucedido, as configurações são salvas e uma mensagem de boas-vindas é enviada ao chat do Telegram.
ru: Перейдите в приложение, в настройках бота введите токен и проверьте настройки, нажав кнопку (также можно задать ID чата, если знаете его). В случае успешной проверки, настройки сохраняются, и в Telegram-чат придёт приветственное сообщение.
zh: 打开应用，在机器人设置中输入令牌并测试设置（如果知道聊天 ID，也可以设置）。如果测试成功，设置将被保存，并向 Telegram 聊天发送欢迎消息。

# help_howToUse_04
source: That's it! Now incoming SMS will be forwarded to your bot.
de: Fertig! Die App ist jetzt bereit, eingehende SMS an Ihren Bot weiterzuleiten. Tippen Sie auf Start, um die SMS-Weiterleitung zu aktivieren, oder auf Stopp, um sie zu deaktivieren.
es: ¡Listo! La app ya está lista para reenviar los SMS entrantes a tu bot. Toca Iniciar para activar el reenvío de SMS o Detener para desactivarlo.
hi: बस! अब ऐप आपके बॉट को आने वाले SMS आगे भेजने के लिए तैयार है। SMS फ़ॉरवर्डिंग सक्षम करने के लिए स्टार्ट दबाएँ, या उसे बंद करने के लिए स्टॉप दबाएँ।
ja: これで完了です！アプリは受信したSMSをボットへ転送する準備ができました。「開始」をタップするとSMS転送が有効になり、「停止」をタップすると無効になります。
pt: Pronto! O app agora está preparado para encaminhar os SMS recebidos para o seu bot. Toque em Iniciar para ativar o encaminhamento de SMS ou em Parar para desativá‑lo.
ru: Готово! Теперь всё настроено, чтобы пересылать входящие СМС вашему боту. Нажмите Старт, чтобы включить пересылку СМС, или Стоп, чтобы отключить.
zh: 就这样！应用现在已准备好将接收的短信转发给你的机器人。点按“开始”以启用短信转发，或点按“停止”将其关闭。

# help_howToUse_04l
source: When forwarding SMS from multiple devices, you can set a device label in settings to identify the receiving phone.
de: Beim Weiterleiten von SMS von mehreren Geräten können Sie in den Einstellungen ein Gerätelabel festlegen, um das empfangende Telefon zu identifizieren.
es: Al reenviar SMS desde varios dispositivos, puedes configurar una etiqueta de dispositivo en ajustes para identificar el teléfono receptor.
hi: कई डिवाइस से SMS भेजते समय, रिसीविंग फ़ोन की पहचान के लिए सेटिंग्स में डिवाइस लेबल सेट कर सकते हैं।
ja: 複数のデバイスからSMSを転送する場合、設定でデバイスラベルを設定して受信電話を識別できます。
pt: Ao encaminhar SMS de vários dispositivos, você pode definir um rótulo de dispositivo nas configurações para identificar o telefone receptor.
ru: При пересылке СМС с нескольких телефонов можно задать метку устройства в настройках — она отправляется боту вместе с СМС для идентификации телефона-получателя.
zh: 从多个设备转发短信时，可以在设置中设置设备标签以识别接收手机。

# help_howToUse_05
source: The app runs in the background, so the system may close it to save battery. To prevent this, disable optimization for the app (usually found in battery settings).
de: Manche Telefone beschränken zur Akkuersparnis die Hintergrundaktivität. Wenn Sie sehr lange Zustellverzögerungen bemerken, deaktivieren Sie die Akkuoptimierung für diese App.
es: Algunos teléfonos pueden limitar la actividad en segundo plano para ahorrar batería. Si notas grandes retrasos en la entrega, desactiva la optimización de batería para la app.
hi: कुछ फ़ोन बैटरी बचाने के लिए बैकग्राउंड गतिविधि को सीमित कर सकते हैं। यदि आपको डिलीवरी में लंबे विलंब दिखाई दें, तो इस ऐप के लिए बैटरी ऑप्टिमाइज़ेशन बंद कर दें।
ja: 一部のスマートフォンでは、省電力のためバックグラウンドでの動作が制限される場合があります。配信が大きく遅れると感じた場合は、このアプリのバッテリー最適化を無効にしてください。
pt: Alguns telefones podem limitar a atividade em segundo plano para economizar bateria. Se você notar grandes atrasos na entrega, desative a otimização de bateria para o app.
ru: Рекомендуется отключить для приложения оптимизацию батареи, поскольку система может ограничивать работу приложений в фоне для экономии заряда.
zh: 某些手机为节省电量可能会限制后台活动。如果你发现短信转达延迟较长，请为本应用关闭电池优化。

# help_howToUse_06
source: Make sure to keep the internet connection enabled for the app to work.
de: Stellen Sie sicher, dass die Internetverbindung aktiviert ist, damit die App funktioniert.
es: Asegúrate de mantener la conexión a internet habilitada para que la app funcione.
hi: सुनिश्चित करें कि ऐप काम करने के लिए इंटरनेट कनेक्शन सक्षम रखें।
ja: アプリが動作するように、インターネット接続を有効にしておいてください。
pt: Certifique-se de manter a conexão com a internet ativada para que o app funcione.
ru: Устройство с работающим приложением должно оставаться подключенным к интернету.
zh: 确保保持互联网连接以使应用正常工作。

# help_filters
source: Filters
de: Filter
es: Filtros
hi: फ़िल्टर
ja: フィルター
pt: Filtros
ru: Фильтры
zh: 筛选器

# help_filters_01
source: You can set filters for sender or text of incoming SMS messages. A filter is triggered if a sender number/name or text contains the specified characters.
de: Sie können Filter für Absender oder Text eingehender SMS festlegen. Ein Filter wird ausgelöst, wenn Nummer/Name des Absenders oder Text die angegebenen Zeichen enthalten.
es: Puedes establecer filtros para el remitente o texto de los mensajes SMS entrantes. Un filtro se activa si el número/nombre del remitente o el texto contiene los caracteres especificados.
hi: आप आने वाले SMS संदेशों के प्रेषक या टेक्स्ट के लिए फ़िल्टर सेट कर सकते हैं। यदि प्रेषक का नंबर/नाम या टेक्स्ट निर्दिष्ट वर्णों को शामिल करता है तो फ़िल्टर ट्रिगर होता है।
ja: 受信したSMSメッセージの送信元またはテキストにフィルターを設定できます。送信元の番号/名前またはテキストに指定された文字が含まれている場合、フィルターがトリガーされます。
pt: Você pode definir filtros para o remetente ou texto das mensagens SMS recebidas. Um filtro é acionado se o número/nome do remetente ou o texto contiver os caracteres especificados.
ru: Можно дополнительно установить фильтры для отправителя или текста входящих СМС. Фильтр срабатывает, если номер/имя отправителя или текст содержат заданные символы.
zh: 您可以为接收短信的发件人或文本设置筛选器。如果发件人号码/名称或文本包含指定字符，则触发筛选器。

# help_filters_02
source: There are two modes: whitelist (SMS is forwarded if at least one filter matches) and blacklist (SMS is not forwarded if any filter matches). In whitelist mode, if no filters are set, no SMS messages will be forwarded to the bot.
de: Es gibt zwei Modi: Whitelist (SMS wird weitergeleitet, wenn mindestens ein Filter zutrifft) und Blacklist (SMS wird nicht weitergeleitet, wenn ein Filter zutrifft). Im Whitelist-Modus werden ohne Filter keine SMS an den Bot weitergeleitet.
es: Hay dos modos: lista blanca (el SMS se reenvía si al menos un filtro coincide) y lista negra (el SMS no se reenvía si algún filtro coincide). En modo lista blanca, si no hay filtros configurados, ningún SMS se reenviará al bot.
hi: दो मोड हैं: व्हाइटलिस्ट (यदि कम से कम एक फ़िल्टर मेल खाता है तो SMS भेजा जाता है) और ब्लैकलिस्ट (यदि कोई फ़िल्टर मेल खाता है तो SMS नहीं भेजा जाता है)। व्हाइटलिस्ट मोड में, यदि कोई फ़िल्टर सेट नहीं है, तो कोई भी SMS बॉट को नहीं भेजा जाएगा।
ja: 2つのモードがあります：ホワイトリスト（少なくとも1つのフィルターが一致した場合にSMSを転送）とブラックリスト（いずれかのフィルターが一致した場合にSMSを転送しない）。ホワイトリストモードでフィルターが設定されていない場合、ボットにSMSは転送されません。
pt: Existem dois modos: lista branca (o SMS é encaminhado se pelo menos um filtro corresponder) e lista negra (o SMS não é encaminhado se algum filtro corresponder). No modo lista branca, se nenhum filtro estiver definido, nenhum SMS será encaminhado ao bot.
ru: Есть два режима: белый список (СМС пересылается, если срабатывает хотя бы один фильтр) и чёрный список (соответственно, не пересылается). В режиме белого списка, если не задано ни одного фильтра, то боту никакие СМС отправляться не будут.
zh: 有两种模式：白名单（如果至少一个筛选器匹配则转发短信）和黑名单（如果任何筛选器匹配则不转发短信）。在白名单模式下，如果未设置筛选器，则不会向机器人转发任何短信。

# help_filters_03
source: Use two forward slashes for regex. For example, filter /^\d*555$/ matches all numbers, that end with 555
de: Verwenden Sie zwei Schrägstriche für Regex. Zum Beispiel trifft Filter /^\d*555$/ auf alle Nummern zu, die mit 555 enden
es: Usa dos barras para regex. Por ejemplo, el filtro /^\d*555$/ coincide con todos los números que terminan en 555
hi: regex के लिए दो स्लैश का उपयोग करें। उदाहरण के लिए, फ़िल्टर /^\d*555$/ सभी नंबरों से मेल खाता है जो 555 पर समाप्त होते हैं
ja: 正規表現には2つのスラッシュを使用してください。例えば、フィルター /^\d*555$/ は555で終わるすべての番号に一致します
pt: Use duas barras para regex. Por exemplo, o filtro /^\d*555$/ corresponde a todos os números que terminam com 555
ru: Используйте два символа /, чтобы задать регулярное выражение в качестве фильтра. Например, фильтр /^\d*555$/ соответствует номерам, которые оканчиваются на 555.
zh: 使用两个斜杠表示正则表达式。例如，筛选器 /^\d*555$/ 匹配所有以 555 结尾的号码

# help_filters_04
source: To check whether a specific SMS message will be forwarded based on the current filters, enter the required sender and/or message in the input fields and click the button to verify.
de: Um zu prüfen, ob eine bestimmte SMS basierend auf den aktuellen Filtern weitergeleitet wird, geben Sie den Absender und/oder die Nachricht in die Felder ein und klicken Sie auf die Schaltfläche.
es: Para verificar si un SMS específico se reenviará según los filtros actuales, introduce el remitente y/o mensaje requerido en los campos y haz clic en el botón para verificar.
hi: यह जांचने के लिए कि वर्तमान फ़िल्टर के आधार पर कोई विशिष्ट SMS भेजा जाएगा या नहीं, इनपुट फ़ील्ड में आवश्यक प्रेषक और/या संदेश दर्ज करें और सत्यापित करने के लिए बटन पर क्लिक करें।
ja: 現在のフィルターに基づいて特定のSMSが転送されるかどうかを確認するには、入力フィールドに必要な送信元やメッセージを入力し、ボタンをクリックして検証してください。
pt: Para verificar se um SMS específico será encaminhado com base nos filtros atuais, insira o remetente e/ou mensagem necessários nos campos de entrada e clique no botão para verificar.
ru: Чтобы проверить, будет ли переслано определённое СМС с учётом установленных фильтров, введите нужного отправителя и/или сообщение в поля ввода и нажмите кнопку для проверки.
zh: 要检查特定短信是否会根据当前筛选器转发，请在输入字段中输入所需的发件人和/或消息，然后点击按钮进行验证。

source: SMS
ru: СМС
zh: 短信
